{
    "POPUP": {
        "SUCCESS_MESSAGES": {
            "DEFAULT": "operation executed successfully",
            "VIRTUAL_TICKET_PATIENT_LOGIN_EMAIL_SENT": "The connection link has been successfully sent to your email.",
            "TICKET_EMAIL_SENT": "The requested ticket was sent to the email address provided.",
            "SCHEDULE_ACTIVITY_ALREADY_TREATED": "Appointment already processed",
            "CREATE_TICKET_WITH_SERVICE_SUCCESS": "Your ticket has been successfully created, check your email inbox to review it.",
            "CREATE_TICKET_SCHEDULE_ACTIVITY_SUCCESS": "Your ticket has been successfully created, check your email inbox to review it.",
            "TICKET_DELETED"   : "Your ticket has been successfully deleted"
        },
        "ERROR_MESSAGES": {
            "DEFAULT": "an error has occurred, try again",
            "FORBIDDEN": "Sorry, the link has expired, please request a new link.",
            "INVALID_ENTRY": "Invalid entry(s)",
            "INVALID_EMAIL": "Please check your Email.",
            "UNKNOWN_KIOSK_GROUP": "Sorry, the laboratory you scanned does not exist. Please scan the QR code again.",
            "INVALID_KIOSK_GROUP": "Sorry, the scanned lab is invalid, please try again later.",
            "KIOSK_GROUP_NOT_LINKED": "Sorry, the scanned lab is not configured, please try again later.",
            "FAR_KIOSK_GROUP": "Sorry, the scanned lab is not in your approximate area, please approach your laboratory and try again.",
            "LIST_NEAREST_KIOSK_GROUPS_ERROR": "An error occurred during the retrieval of the laboratories.",
            "SCAN_KIOSK_GROUP_ERROR": "An error occurred during the retrieval of the laboratory.",
            "SERVICE_LIST_SERVER_ERROR": "An error occurred during the retrieval of the services.",
            "SCHEDULE_ACTIVITY_NOT_FOUND": "Appointment not found, please verify!",
            "QUEUE_NOT_FOUND_OR_NOT_IN_TIME_RANGE": "Selected service not found or out of time",
            "SCHEDULE_ACTIVITY_IN_WRONG_KIOSK_GROUP": "Your appointment corresponds to another laboratory.",
            "TICKET_EMAIL_NOT_SENT": "Unable to send ticket email, try again",
            "TICKET_EMAIL_ERROR": "An error occurred while sending the ticket email",
            "SERVICE_NOT_FOUND": "Service not found, please try again later",
            "KIOSK_GROUP_NOT_FOUND": "Laboratory not found, please try again later",
            "DAILY_VIRTUAL_TICKETS_COUNT_REACHED": "Daily virtual tickets count reached",
            "CREATE_TICKET_ERROR": "An error occurred during ticket creation.",
            "VIRTUAL_TICKET_PATIENT_LOGIN_EMAIL_NOT_SENT": "Unable to send authentication email, try again",
            "VIRTUAL_TICKET_PATIENT_EMAIL_ERROR": "An error occurred while sending the authentication email",
            "TICKET_NOT_FOUND": "Ticket not found",
            "RETRIEVE_TICKET_ERROR": "An error occurred during the retrieval of the ticket",
            "VALIDATE_TICKET_ERROR": "An error has occurred while validating your ticket.",
            "UNKOWN_ERROR": "an error occurred, please try again later. if the error persists, contact the administrator",
            "msg1": "You are too far from the laboratory. Please stay nearby until your scheduled appointment time. \n\n Your ticket will be automatically deleted if you are not near the laboratory 15 minutes before the scheduled time",
            "DELETE_TICKET_ERROR" : "Error deleting ticket. Please try again or contact support.",
            "NOT_NEARBY" :"You are far from the lab, please make sure to  be in close proximity or else your ticket will be deleted."
        }
    }
}
